<?php

return [
    'required' => 'هذا الحقل مطلوب.',
    'email' => 'يرجى إدخال بريد إلكتروني صحيح.',
    'unique' => 'هذه القيمة مستخدمة بالفعل.',
    'min' => [
        'string' => 'يجب ألا يقل عن :min أحرف.',
    ],
    'max' => [
        'string' => 'يجب ألا يزيد عن :max حرفًا.',
    ],
    'password' => '',
    'confirmed' => 'حقل التأكيد غير مطابق.',
    'integer' => 'يجب إدخال رقم صحيح.',
    'date' => 'يرجى إدخال تاريخ صحيح.',
    'after_or_equal' => 'يجب أن يكون التاريخ اليوم أو بعده.',
    'exists' => 'القيمة المختارة غير صحيحة.',
    'date_format' => 'صيغة الوقت غير صحيحة (مثال: 18:30).',

];
